[
  {
    "id": "sigiriya",
    "title": "The Lion Rock: Sigiriya's Ancient Mystery",
    "excerpt": "Climb the legendary stone citadel and discover the history of King Kashyapa's palace in the sky.",
    "content": "Sigiriya or Sinhagiri is an ancient rock fortress located in the northern Matale District near the town of Dambulla in the Central Province, Sri Lanka. It is a site of historical and archaeological significance that is dominated by a massive column of rock around 180 metres high.\n\nAccording to the ancient Sri Lankan chronicle the Culavamsa, this area was a large forest, then after storms and landslides it became a hill and was selected by King Kashyapa for his new capital. He built his palace on top of this rock and decorated its sides with colourful frescoes. On a small plateau about halfway up the side of this rock he built a gateway in the form of an enormous lion. The name of this place is derived from this structure; Sīhāgiri, the Lion Rock.\n\nThe capital and the royal palace were abandoned after the king's death. It was used as a Buddhist monastery until the 14th century. Sigiriya today is a UNESCO listed World Heritage Site. It is one of the best preserved examples of ancient urban planning.",
    "image": "https://images.unsplash.com/photo-1588596389718-47291a10052c?q=80&w=2070&auto=format&fit=crop",
    "category": "History",
    "tags": ["Ancient", "UNESCO", "Hiking", "Culture"],
    "location_cluster": "Cultural Triangle",
    "location": "Matale District",
    "coordinates": { "lat": 7.957, "lng": 80.7603 }
  },
  {
    "id": "ella",
    "title": "Ella: My Journey Through Sri Lanka's Misty Mountains",
    "excerpt": "From the iconic Nine Arch Bridge to the sunrise at Little Adam's Peak, Ella is a feeling of serene isolation mixed with the thrill of discovery.",
    "content": "Nestled in the heart of the Uva Province, Ella is more than just a destination; it’s a feeling. During my visit, I realized why travelers call it a backpacker's paradise. The air is perpetually cool, carrying the scent of fresh pine and drying tea leaves, a welcome change from the coastal heat.\n\nMy first stop was the legendary **Nine Arch Bridge**. Completed in 1921, this marvel of colonial-era engineering was built entirely of stone and brick without a single piece of steel. Standing there as the blue train winds its way across the arches is a surreal experience that feels like stepping back into Old Ceylon.\n\nFor those who love a good view, **Little Adam’s Peak (Punchi Sri Pada)** is a must. It's an easy yet rewarding hike that offers panoramic 360-degree views of the Ella Gap. If you're feeling more adventurous, **Ella Rock** presents a tougher challenge but rewards you with a cliff-edge view that overlooks the vast valleys below.\n\nDon't forget the myths and legends! **Ravana Falls and Cave** are steeped in the Ramayana epic. These falls are among the widest in the country and are said to be the hiding place of Princess Sita. \n\n**Traveler Tip:** If you're taking the train from Kandy, try to sit on the right side for the most breathtaking views of the tea estates. To catch the Nine Arch Bridge without the crowds, get there before 8:00 AM!",
    "image": "https://images.unsplash.com/photo-1546708973-b339540b5162?q=80&w=2070&auto=format&fit=crop",
    "category": "Travel Log",
    "tags": ["Backpacking", "Mountains", "Nine Arch", "Adventure"],
    "location_cluster": "Hill Country",
    "location": "Badulla District",
    "coordinates": { "lat": 6.8667, "lng": 81.0466 }
  },
  {
    "id": "galle",
    "title": "Galle Fort: Where History Meets the Ocean",
    "excerpt": "Walk through the cobblestone streets of the Dutch Fort and experience a unique blend of architecture.",
    "content": "Galle Fort, in the Bay of Galle on the southwest coast of Sri Lanka, was built first in 1588 by the Portuguese, then extensively fortified by the Dutch during the 17th century from 1649 onwards. It is a historical, archaeological and architectural heritage monument, which even after more than 432 years maintains a polished appearance, due to extensive reconstruction work done by the Archaeological Department of Sri Lanka.\n\nThe fort has a colourful history, and today has a multi-ethnic and multi-religious population. The heritage value of the fort has been recognized by the UNESCO and the site has been inscribed as a cultural heritage UNESCO World Heritage Site under Site IV, for its unique exposition of 'an urban ensemble which illustrates the interaction of European architecture and South Asian traditions from the 16th to the 19th centuries.'",
    "image": "https://images.unsplash.com/photo-1586500036706-41963de24d8b?q=80&w=1974&auto=format&fit=crop",
    "category": "History",
    "tags": ["Colonial", "Beach", "UNESCO", "Architecture"],
    "location_cluster": "South Coast",
    "location": "Galle",
    "coordinates": { "lat": 6.0329, "lng": 80.2168 }
  },
  {
    "id": "yala",
    "title": "Wildlife Safari: In Search of the Leopard",
    "excerpt": "Explore Yala National Park, home to one of the highest leopard densities in the world.",
    "content": "Yala National Park is the most visited and second largest national park in Sri Lanka, bordering the Indian Ocean, in the Southeast region of the country. The park consists of five blocks, two of which are now open to the public, and also adjoining parks. The blocks have individual names such as Ruhuna National Park (block 1) and Kumana National Park or 'Yala East' for the adjoining area.\n\nIt is situated in the dry semi-arid climatic region and rain is received mainly during the northeast monsoon. Yala hosts a variety of ecosystems ranging from moist monsoon forests to freshwater and marine wetlands. It is one of the 70 Important Bird Areas (IBAs) in Sri Lanka. Yala harbours 215 bird species including six endemic species of Sri Lanka. The number of mammals that has been recorded from the park is 44, and it has one of the highest leopard densities in the world.",
    "image": "https://images.unsplash.com/photo-1549405178-68e7f1e78457?q=80&w=1935&auto=format&fit=crop",
    "category": "Wildlife",
    "tags": ["Safari", "Animals", "Adventure", "Nature"],
    "location_cluster": "Deep South",
    "location": "Tissamaharama",
    "coordinates": { "lat": 6.3711, "lng": 81.5161 }
  },
  {
    "id": "kandy",
    "title": "Spiritual Kandy: The Sacred Tooth Relic",
    "excerpt": "Visit the cultural capital of Sri Lanka and the sacred Temple of the Tooth Relic.",
    "content": "Kandy is a major city in Sri Lanka located in the Central Province. It was the last capital of the ancient kings' era of Sri Lanka. The city lies in the midst of hills in the Kandy plateau, which crosses an area of tropical plantations, mainly tea. Kandy is both an administrative and religious city and is also the capital of the Central Province. Kandy is the home of the Temple of the Tooth Relic (Sri Dalada Maligawa), one of the most sacred places of worship in the Buddhist world. It was declared a world heritage site by UNESCO in 1988.",
    "image": "https://images.unsplash.com/photo-1620619767323-b95a89183081?q=80&w=2070&auto=format&fit=crop",
    "category": "Culture",
    "tags": ["Sacred", "Buddhism", "UNESCO", "Temples"],
    "location_cluster": "Central Highland",
    "location": "Kandy",
    "coordinates": { "lat": 7.2906, "lng": 80.6337 }
  },
  {
    "id": "mirissa",
    "title": "Whale Watching and Sunset Vibes in Mirissa",
    "excerpt": "Relax on the golden sands of Mirissa and witness the majestic blue whales in the deep blue.",
    "content": "Mirissa is a small town on the south coast of Sri Lanka, located in the Matara District of the Southern Province. It is approximately 150 kilometres south of Colombo and is situated at an elevation of 4 metres above sea level. Mirissa's beach and nightlife make it a popular tourist destination. It is also a fishing port and one of the island's main whale and dolphin watching locations.",
    "image": "https://images.unsplash.com/photo-1544218520-43510e15645e?q=80&w=1934&auto=format&fit=crop",
    "category": "Beach",
    "tags": ["Surfing", "Whales", "Nightlife", "Sunset"],
    "location_cluster": "South Coast",
    "location": "Matara District",
    "coordinates": { "lat": 5.9483, "lng": 80.4573 }
  }
]
